{
  "arguments":[
    {
      "name":"Beyond Natural",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"Historically, <i>shamanism</i> is the practice where a <i>shaman</i> (often the leader of a group of people such as a tribe or village) acts as a conduit between the natural world and the supernatural.  Shaman will often use <i>prayer, fasting, ritual</i> and <i>altered consciousness</i> to contact spirits. They use this spirit contact to find information or seek help.  This can include information about prosperity (<i>food, wealth</i>), health (<i>diagnosis and cure of illness</i>) and foreknowledge (<i>future or life instruction</i>).  These spiritual forces can even be used to protect and attack. Has you or anyone on your behalf attempted 'contacting' the spirit world to obtain help or knowledge?"
        },
        {
          "yes":2,
          "no":2,
          "content":"Until the 15th century, <i>witches</i> in Europe understood that the spirits they were contacting were <i>demonic</i>.  Both the witches and their opponents were quick to point out that the power behind witchcraft had evil and damaging consequences.  This would often be referred to as <i>black magic</i> (when antagonistic) and included magic warfare, astral projection and drug use (<i>Bufotenin</i>). Many believe that black magic is bad, but there is a 'good' magic (that provides knowledge of the future, healing, prosperity) called <i>white magic</i>.  Do you believe there is a 'good' magic?"
        },
        {
          "yes":3,
          "no":5,
          "content":"<i>Charms, incantations, fortune telling, spells, Jin, spiritual bridges</i> (priests, imam, witch doctors, healers) are all used to gain a positive result. Whether white or black, using supernatural occult powers is always seen as a process controlled by ritual and those preforming the ritual (<i>as seen by their desire to select incantations, select spirits to invoke or protect themselves with another ritual</i>).  When a shaman, witch, spiritist or casual occult user uses a spirit, is he or she in control?  Is the user in control of this extremely powerful force?"
        },
        {
          "yes":4,
          "no":4,
          "content":"The earth is 6 septillion kilograms, contains over 7 billion people and travels at 107,000 km/h around the sun. Man is less than 100 kilograms, can move up to 45km/h and is singular.  The earth is larger, faster, has more identity (through multiple individuals) and astronomically heavier.  No person in their right mind would say that they move the earth.  Is it true that man is propelled by a powerful rotating mass orbiting the sun? Does the more powerful earth direct man's motion?"
        },
        {
          "no":5,
          "content":"If I say words in the correct order, fast or carry charms is there any chance that I will be able to take control of the rotation, axis or movement of the earth and its 7 billion inhabitants?"
        },
        {
          "content":"If it is impossible for a man to control a force extraordinarily more powerful than himself through ritual, why would someone think they can control supernatural spirits that have greater intelligence, physical and spiritual power, organization and influence than a fallible man?  Is man using these supernatural forces or are these supernatural forces using the men and women who call them?  Is there any occult activity in your past (charms, idols, spirits, priests, incantations, rituals, drugs) that you need help with?"
        }
      ]
    },
    {
      "name":"Why Hinduism?",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"Should anyone believe the Vedas / Hinduism? (<em>Why?</em>)"
        },
        {
          "yes":2,
          "content":"Is everything one? (<em>i.e. no distinctions</em>)"
        },
        {
          "yes":3,
          "content":"Is the problem with the world that we think in separations? (<em>Maya</em>)"
        },
        {
          "no":4,
          "content":"Are you in Nirvana right now?"
        },
        {
          "yes":5,
          "content":"If you act can you reach Nirvana?"
        },
        {
          "content":"If there is a distinction between where you are (<em>here or Nirvana</em>) and the actions you perform (<em>that bring you closer to Nirvana or those that don't</em>), then the religion that says distinctions are bad exists by making numerous distinctions. It is its own problem."
        }
      ]
    },
    {
      "name":"Culpability",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"Should a man who is guilty of murder be able to decide his own punishment?"
        },
        {
          "yes":2,
          "no":2,
          "content":"Should a thief be allowed to set the punishment for larceny, robbery or theft?"
        },
        {
          "yes":3,
          "no":3,
          "content":"Should a sexual offender decide the age of consent?"
        },
        {
          "yes":5,
          "no":4,
          "content":"Have you ever had intimate relations with someone other than your spouse?"
        },
        {
          "yes":5,
          "no":5,
          "content":"Have you ever viewed intimate relations of others (<i>pornography</i>)?"
        },
        {
          "yes":6,
          "no":6,
          "content":"Have you ever stolen anything?"
        },
        {
          "yes":8,
          "no":7,
          "content":"Have you ever murdered anyone?"
        },
        {
          "yes":8,
          "no":8,
          "content":"Have you ever hated anyone?"
        },
        {
          "content":"If you are guilty of any of the previous offenses, why should you be able to say that morality is an illusion? Why should you be able to explain away your guilt?"
        }
      ]
    }
  ],
  "problem": "<b>Lack of Works<b><br/>(<em>Samsara</em>)<br/><b>Illusion</b>",
  "law":"<b>No personal force exists within Hinduism to prescribe justice</b>. 'God' consists of an immaterial, impersonal force that is recognized as an ideal state. Our current situation - the one in which judgment would be required - is illusory.  Therefore, <b>good and evil are illusions</b> and making this very distinction (or any distinction) is problematic. All justice centers upon the individual's return to Brahma (the immaterial impersonal being of 'God').",
  "punishment":"<b>As good and evil are anethma to Hinduism, it can not recognize strict moral distinctives</b>. Ironically, the mode through which an individual is translated to Brahma, is via the completion of works or deeds recognized as good.  An individuals Atman (soul) becomes closer or further to integration with Brahma following successive reincarnations weighed against their good works.  <b>Karma is seen to reconcile immediate consequence, as system of reciprocity, with no strict moral law</b>.",
  "hope":"In Hinduism, god is <b>in</b> everything. Therefore <b>Brahma is the silent author of all hate, murder, rape or evil</b>.  This problem is supposedly resolved with the idea that those experiencing this negativity are deserving of it (<em>caught in the wheel of Samsara</em>).  This results in man believing he should never help anyone oppressed (as they deserve it). Through Samsara, Brahma, being infinite and perfect, is reached by imperfect flawed men.  <b>How can a finite man reach an infinitly 'perfect' god through works?</b><br/><br/>The initial and ultimate problem is said to be distinction; between Maya and Moksha. By calling distinction evil, Hinduism errs, defining Maya separate from Moksha, merit from demerit, mundane from bliss.  With no distinction, there is ultimately no logic, reason, compassion, right, wrong, etc. and therefore no law or justice."
}