{
  "arguments":[
    {
      "name":"Are You Good?",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"Is anything more important to you than God?"
        },
        {
          "yes":2,
          "no":2,
          "content":"Do you honor your parents?"
        },
        {
          "yes":4,
          "no":3,
          "content":"Have you ever murdered anyone?"
        },
        {
          "yes":4,
          "no":4,
          "content":"Jesus said whoever hates his brother is guilty of the same punishment as murder (<em>Matthew 5:21-22</em>). Have you hated anyone in your heart?"
        },
        {
          "yes":6,
          "no":5,
          "content":"Have you had intimate relations with someone you are not married too?"
        },
        {
          "yes":6,
          "no":6,
          "content":"Jesus says that anyone who looks at a women (or man) with sexual greed (lust) is has committed adultery in his (her) heart (<em>Matthew 5:28</em>). Have you looked at anyone lustfully?"
        },
        {
          "yes":7,
          "no":7,
          "content":"Have you ever stolen anything? (<em>size or value is irrelevant</em>)"
        },
        {
          "yes":8,
          "no":8,
          "content":"Have you ever lied?"
        },
        {
          "yes":9,
          "no":9,
          "content":"Have you every been greedy or had selfish ambition?"
        },
        {
          "content":"If you answered yes to the first question God calls you an idolater. If yes to the third or fourth you are a murderer. If yes to the fifth or sixth you are an adulterer, a fornicator or sexually immoral. If yes to the seventh, a thief. The eighth, a liar.  The ninth, greedy and covetous.  The Bible is clear that anyone who breaks any of God's laws (<em>Exodus 20</em>) is punished with death.  Are you good (<em>or bad</em>)?"
        }
      ]
    },
    {
      "name":"Genuine Follower",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"Brazil currently sends more recorded Christian missionaries than the United States (previous recorded leader, beating the U.K.), despite the U.S. having a substantially larger protestant Christian population. <b>Does this indicate Brazilians are better Christians?</b>"
        },
        {
          "yes":2,
          "no":2,
          "content":"The United States and Canada both have <i>Christian populations in excess of <b>65%</b></i>.  Is it acceptable that the US produces <b>25%</b> of all illicit internet traffic? Or that both have 3 times the global average of divorced families? <b>Is it also acceptable that both nations support abortion and recognized homosexual union?</b>"
        },
        {
          "yes":3,
          "no":3,
          "content":"Jesus said, \"<i>Why do you call me Lord, Lord and do not do what I say?</i>\" and stated \"<i>if you love Me, you will keep my commands</i>\". <b>Can someone be a follower of Christ and continually and willingly violate God's law?</b>"
        },
        {
          "content":"Jesus said \"<i>Many will say to me on [final judgement] 'Lord, Lord, did we not prophesy in your name and in your name drive out demons and in your name perform many miracles?' Then I will tell them plainly, ‘I never knew you; depart from Me, you workers of lawlessness!</i>\" <b>are you a worker of lawlessness?</b>"
        }
      ]
    }
  ],
  "problem": "<b>The Heart of Man</b><br/>(You)",
  "law":"<b>Every individual will be judged*.  Each breach of law is punishable*</b>. Every law given of God represents Him*.  When someone rejects God's law they are not only creating grevious offense, they are despising God's nature.  Violations of the law are rejections of God and will be severely punished. (<b>'the light has come into the world, and people loved the darkness rather than the light because their works were evil'</b>*)  [<em>Heb 9:27, Rom 6:23, John 1:1, John 3:19</em>]",
  "punishment":"<b>Violating even one law brings the sentence of death*</b>.  This physical death provisions eternal torment for violations of the law.  Therefore <b>the physical body is destroyed while the soul is sent by a just God to hell</b>.  Hell is described as a fiery burning lake*, eternal punishment* and full of crying and agony*. [<em>Romans 6:23, Rev. 21:8, Matt 25:46, Matt 13:50</em>]",
  "hope":"<b>The punishment of death we deserve was paid by one who is innocent</b> (<em>i.e. does not have to pay the penalty themselves</em>). God Himself came to earth, and lived a perfect moral life.  <b>He commands we must turn from evil and turn to Him</b>. God was killed by evil man.  God - in the person of Jesus - could not remain dead and rose three days after His murder.  Jesus, having received the punishment for all sinful men can justify (<em>make men right with God - the law giver</em>) men who trust and obey Him (<em>Philippians 3:9</em>). <b>Christ's death on behalf of man's guilt and resurrection was the only remedy for breaching God's law and any man facing the punishment of hell</b>."
}