{
  "arguments":[
    {
      "name":"Eastern Spirituality",
      "slides":[
        {
          "yes":1,
          "no":3,
          "content":"<b>Are you Taoist?</b> (<em>Qingming / Wu-Wei / Lau Tzu - Tao Te Ching</em>)<br><b>Are you Buddhist?</b> (<em>Transcendent / Siddhartha</em>)<br><b>Are you Confucian?</b> (<em>Analetics</em>)<br><b>Are you practising Traditional Chinese Religion?</b> (<em>Tian & Qi / Shrine</em>)"
        },
        {
          "yes":2,
          "content":"Do you know that Confucius or Lao Tzu is right? Is it right for someone to declare themselves perfect (Siddhartha Guatama)?"
        },
        {
          "yes":3,
          "no":3,
          "content":"Is it a contradiction to desire not to desire as the Buddha claims one must do?"
        },
        {
          "content":"Buddhism is more spiritual than philosophical frameworks such as Confucian.  Historically, philisophical frameworks such as Taoism and Confucianism eventually adopt religious ideas such as Buddhism, Traditional Chinese Religion (with Heaven and Hell) or fail against religious frameworks such as Shintoism.  Can a belief system be an accurate explaination of reality if it continually requires new religious ideas?"
        }
      ]
    },
    {
      "name":"Beyond Natural",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"Historically, <i>shamanism</i> is the practice where a <i>shaman</i> (often the leader of a group of people such as a tribe or village) acts as a conduit between the natural world and the supernatural.  Shaman will often use <i>prayer, fasting, ritual</i> and <i>altered consciousness</i> to contact spirits. They use this spirit contact to find information or seek help.  This can include information about prosperity (<i>food, wealth</i>), health (<i>diagnosis and cure of illness</i>) and foreknowledge (<i>future or life instruction</i>).  These spiritual forces can even be used to protect and attack. Has you or anyone on your behalf attempted 'contacting' the spirit world to obtain help or knowledge?"
        },
        {
          "yes":2,
          "no":2,
          "content":"Until the 15th century, <i>witches</i> in Europe understood that the spirits they were contacting were <i>demonic</i>.  Both the witches and their opponents were quick to point out that the power behind witchcraft had evil and damaging consequences.  This would often be referred to as <i>black magic</i> (when antagonistic) and included magic warfare, astral projection and drug use (<i>Bufotenin</i>). Many believe that black magic is bad, but there is a 'good' magic (that provides knowledge of the future, healing, prosperity) called <i>white magic</i>.  Do you believe there is a 'good' magic?"
        },
        {
          "yes":3,
          "no":5,
          "content":"<i>Charms, incantations, fortune telling, spells, Jin, spiritual bridges</i> (priests, imam, witch doctors, healers) are all used to gain a positive result. Whether white or black, using supernatural occult powers is always seen as a process controlled by ritual and those preforming the ritual (<i>as seen by their desire to select incantations, select spirits to invoke or protect themselves with another ritual</i>).  When a shaman, witch, spiritist or casual occult user uses a spirit, is he or she in control?  Is the user in control of this extremely powerful force?"
        },
        {
          "yes":4,
          "no":4,
          "content":"The earth is 6 septillion kilograms, contains over 7 billion people and travels at 107,000 km/h around the sun. Man is less than 100 kilograms, can move up to 45km/h and is singular.  The earth is larger, faster, has more identity (through multiple individuals) and astronomically heavier.  No person in their right mind would say that they move the earth.  Is it true that man is propelled by a powerful rotating mass orbiting the sun? Does the more powerful earth direct man's motion?"
        },
        {
          "no":5,
          "content":"If I say words in the correct order, fast or carry charms is there any chance that I will be able to take control of the rotation, axis or movement of the earth and its 7 billion inhabitants?"
        },
        {
          "content":"If it is impossible for a man to control a force extraordinarily more powerful than himself through ritual, why would someone think they can control supernatural spirits that have greater intelligence, physical and spiritual power, organization and influence than a fallible man?  Is man using these supernatural forces or are these supernatural forces using the men and women who call them?  Is there any occult activity in your past (charms, idols, spirits, priests, incantations, rituals, drugs) that you need help with?"
        }
      ]
    },
    {
      "name":"Plausible Atheism?",
      "slides":[
        {
          "yes":1,
          "content":"Does all of humanity and the universe exist as a result of constant change in a material environment?"
        },
        {
          "no":2,
          "content":"<b>Does anything exist outside of the physical material world?</b> (<em>God, supernatural phenomena</em>)"
        },
        {
          "no":3,
          "content":"<b>Does anything exist in the universe that is not changing?</b>"
        },
        {
          "yes":4,
          "no":4,
          "content":"<b>Do universal / absolute laws of logic exist?</b> (<em>Or are laws of logic changing? Has there or will there ever been a point where the law of noncontradiction fails?</em>)"
        },
        {
          "yes":5,
          "no":5,
          "content":"<b>Do universal / absolute laws of mathematics exist?</b> (<em>Has there ever been a moment where the principles that comprise calculus, algebra or numeracy were untrue? Will there be a time when numeracy will be false?</em>)"
        },
        {
          "yes":6,
          "no":6,
          "content":"<b>Do universal / absolute laws exist in the physical and natural world?</b> (<em>Has formal scientific methodolgy [i.e. repeatability] ever been falacious? Will there be a time in the future when it fails?</em>)"
        },
        {
          "yes":7,
          "no":7,
          "content":"<b>Do universal / absolute laws of morality exist?</b> (<em>Is rape, incest, theft and murder only wrong situationally, or are these principles absolutely morally repugant?</em>)"
        },
        {
          "no":8,
          "content":"<b>Are any of these laws material?</b> (<em>are they dependent on the material world?  For example, if you disappeared tomorrow would the law of non-contradiction disappear?</em>)"
        },
        {
          "content":"Is it possible for a material universe composed of change to produce immaterial permanent facets? Without immaterial unchanging principles could we make any statements of fact, logic, observation or reason (<em>In a material, changing framework how do these principles hold? If they do not, how can we use reason, logic or math?</em>)."
        }
      ]
    },
    {
      "name":"Culpability (S. Ten Bruggencate)",
      "slides":[
        {
          "yes":1,
          "content":"Does a judge (in court) need to be unbiased (<i>not guilty, affecting all equally</i>)?"
        },
        {
          "no":2,
          "content":"In a court of law is it the job of the accused to decide his/her guilt?"
        },
        {
          "yes":3,
          "no":3,
          "content":"In a court of law is it the job of the judge to deliberate regarding guilt?"
        },
        {
          "yes":4,
          "no":4,
          "content":"If you are to make a decision upon God and truth, <b>do you have the correct authority to decide upon all of the material universe, all moral dilemma and all known knowledge?</b>"
        },
        {
          "content":"Are you morally culpable? (<i>Do you hate God, are you guilty of lying, railing, sexual perversion, hatred, greed</i>)"
        }
      ]
    },
    {
      "name":"Capability",
      "slides":[
        {
          "no":1,
          "content":"In 1971 Kim Ung-Yong began to work for NASA at the age of 8, recieving a PhD in math at 15.   In 2012, Juliet Beni received a medical doctorate from the University of California at 19 years of age. Similar youth have been described as being two to three times smarter than their doctoral peers. Do these individuals know everything?"
        },
        {
          "yes":3,
          "no":2,
          "content":"Would it be fair to say that these individuals know less than <b>10%</b> of all human knowledge?"
        },
        {
          "yes":3,
          "no":3,
          "content":"Would it be fair to say that these individuals know less than <b>50%</b> of all human knowledge?"
        },
        {
          "yes":4,
          "no":4,
          "content":"Are you smarter than these individuals or similar gifted minds?"
        },
        {
          "yes":5,
          "no":5,
          "content":"Is it possible that some knowledge outside of your understanding negates everything you currently declare? (<i>Could you be wrong?</i>)"
        },
        {
          "content":"You are using rationality and repeatability. <b>Within your belief, what guarantees either?</b> Can chance, change and material produce immutability, rationality and repeatability?"
        }
      ]
    }
  ],
  "problem": "<b>Lack of Works</b><br/>(<em>Traditional</em>)<br/><b>Suffering</b><br/>(<em>Atheism</em>)",
  "law":"Traditional Chinese Belief has no foundation for moral authority. <b>Moral character is shaped through superstitious fear or cultural pressure</b>.<br/><br/><b>Atheism or Agnostisms has no provision for moral authority</b>. Sam Harris*, states that it is more noble to reduce suffering than follow moral authority.  Christopher Hitchens* stated that human decency is antecedent to God / Religion. Neil Degrasse Tyson states that a primary motive is the reduction of suffering. This loose goal contradicts itself under different cultural parameters and personal interpretations.[<em>2006 Beyond Belief Conference, God is not Great</em>]",
  "punishment":"<b>Cultural mechanisms of legal enforcement (often based in fear) are at best arbitrary and violable</b>.<br><br><b>No naturalistic (Atheist) mechanisms for the remedy of moral violations is present</b>. At best we are asked to reduce suffering. The only active mechanism present within Atheism is natural selection alone.  As selection pressure has no regard for morality and can be immoral, there is no inducements or enforcements of moral concepts beyond nature.",
  "hope":"God supposedly remains silent to the mind of an Atheist or strict Chinese Traditionalist.  With no foundation for even simple logic (<em>in atheism, how can an unchanging immaterial parameter exist in a changing, solely temporal, material universe</em>).  <b>While no Atheist practically believes morality, logic or reason does not exist, there is no way to account for any in their ideology</b>. All is merely a construct of biological or natural processes. There is no morality and therfore no justice."
}