{
  "arguments":[
    {
      "name":"Before the Quran [Short]",
      "slides":[
        {
          "yes":1,
          "no":4,
          "content":"Can Allah's words or decrees change?"
        },
        {
          "yes":2,
          "content":"\"<i>And none can alter the words (decrees) of Allah</i>\" Surah 6:34"
        },
        {
          "yes":3,
          "no":4,
          "content":"Can Allah's words or decrees change?"
        },
        {
          "content":"Then, why should you trust the Quran?"
        },
        {
          "yes":6,
          "no":5,
          "content":"Are the Tawrat (Torah), Zabur (Psalms of David) and Injil given by Allah?"
        },
        {
          "yes":6,
          "content":"\"<i>And [Allah] revealed the Torah and the Gospel</i>\" Surah 3:3, \"<i>...and to David we gave the Zabur</i>\" Surah 6:163"
        },
        {
          "yes":7,
          "content":"Then the Tawrat, Zabur and Injil are unchanging. Correct?"
        },
        {
          "content":"Then, why are there massive contradictions between revelation?"
        }
      ]
    },
    {
      "name":"Before the Quran [Long]",
      "slides":[
        {
          "yes":2,
          "no":1,
          "content":"Does the Quran confirm previous scripture (Taurat, Zabur and Injil)?"
        },
        {
          "yes":2,
          "content":"Consider Surah 12:111. \"...[the Qur'an] is not a fabricated story, but a verification of [the Torah and Gospel] which IS between his hands...\"  The Quran refers to the the Jewish Taurat and Zabur and the Christian Injil 105 times. Does the Quran confirm previous scripture?"
        },
        {
          "yes":3,
          "no":3,
          "content":"Did you know that the Quran states that the Christian and Jewish scriptures were correct at the time of Jesus (3 B.C. To 30 A.D.)? (Sura 3:48, 3:49-50, 5:49, 5:113, 19:12, 66:12).<br><br>\"<i>And remember, Jesus, the son of Mary, said: `Oh Children of Israel! I am the apostle of God to you, confirming that which IS between my hands from the Torah...'</i>\" (61:6)"
        },
        {
          "yes":4,
          "no":4,
          "content":"Did you know that according to the Quran accurate Christian and Jewish scriptures existed after Jesus, but before Muhammed (30 A.D. To 571 A.D.)?  (Sura 3:52-53, 5:113-114, 18:10, 18:25, 57:26-27, 85:4-9)"
        },
        {
          "yes":5,
          "no":5,
          "content":"Did you know that according to the Quran the Christian and Jewish scriptures where correct at the time of Muhammad (571 A.D. To 632 A.D.)? (Sura 34:31, 10:37, 6:154-157, 40:69-70, 46:12, 46:29-30, 2:91, 35:31, 4:162-163, 9:111, 5:51)<br>\"<i>It is [Allah] who sent down to thee the Book in truth, attesting to (the truth of) what IS between [his] hands (the Bible), and He sent down the Torah and the Gospel before this as a guide to mankind.</i>\" (3:3)"
        },
        {
          "yes":7,
          "no":6,
          "content":"Is there a difference between today's Quran and today's Christian & Jewish scriptures?"
        },
        {
          "no":7,
          "content":"Jesus is not God (Quran) vs Jesus is God and man. Jesus is not killed (Quran) vs Jesus is crucified and raises to life. Miriam (Moses sister, 1500 years before Christ) is Jesus mother (Quran) vs Mary. Jewish people returned to Egypt (Quran) vs no historical or textual evidence. Jews where few (Quran) vs Pharaoh fearing the multitude. Pharaoh's wife adopts Moses (Quran) vs Pharaoh's daughter. Plus more. Are you sure there are no differences?"
        },
        {
          "yes":9,
          "no":8,
          "content":"Is there a difference between todays Quran and todays Christian & Jewish scriptures?"
        },
        {
          "content":"Than the Quran is incorrect.  It has multiple discrepancies with prior revelation.  The 105 references within the Quran to prior scriptures are wrong."
        },
        {
          "content":"In the 10th century, Spanish Poet Ibn Hazm developed the doctrine of Tahrif: that the Jewish and Christian scriptures had changed after Muhammad.  Ignoring that we know exactly what Christian and Jewish scriptures were from 100 A.D onward, if we accept Ibn Hazm, the Quran is incorrect when it says in Sura 6:115 and 18:17 that Allah's words and knowing never change (while claiming Zabur, Tawrat, Injil were Allah's)."
        }
      ]
    },
    {
      "name":"Quran: Tawhid & Language",
      "slides":[
        {
          "yes":1,
          "no":3,
          "content":"<![CDATA[Can anything in human experience describe God?]]>"
        },
        {
          "yes":2,
          "content":"\"<i>There is nothing like unto [Allah]</i>\" Surah 42:11c"
        },
        {
          "no":3,
          "content":"Can anything in human experience describe Allah?"
        },
        {
          "yes":5,
          "no":4,
          "content":"Is the Quran written in the Arabic language?"
        },
        {
          "yes":5,
          "content":"\"<i>Indeed, we have sent down as an Arabic Quran that you might understand</i>\" Surah 12:2"
        },
        {
          "no":6,
          "content":"Can you give me an example of a sentence that does not reference human experience?"
        },
        {
          "content":"How can the Quran possibly be what it claims (revelation of a transcendent God) if it is entirely immanent?"
        }
      ]
    },

    {
      "name":"Quran: Plagiarism",
      "slides":[
        {
          "yes":1,
          "content":"The Quran says it is \"<em>A Book [Allah] sent down to you so that [Muhammad] may bring forth mankind from the darkness into the light...</em>\"(14:1) and that the angel Gabriel revealed the text to Muhammad \"<em>it is [Gabriel] who has revealed (this book) to [Muhammad's] heart by God's permission.</em>\" (2:97) Is this true?"
        },
        {
          "yes":2,
          "content":"The Quran says it is a confirmation of one book that came prior to it \"<em>it is a confirmation of (revelations) that were sent before it, and a full explanation of the book.</em>\" (10:37)?  That book is the Judeo-Christian Scriptures referred to as the Torah, Injil and Zabur revealed by prophets such as Ibrahim, Isma’il, Ishaq, Ya’qub and their children, and to Isa, Ayyub, Yunus, Harun, and Salaiman, and Dawud. Is this true?"
        },
        {
          "yes":3,
          "no":4,
          "content":"Is it possible for man to create a text like the Quran?"
        },
        {
          "no":4,
          "content":"\"<em>This Qur’an is not such as can be produced by other than Allah...</em>\" (10:37) Are you sure it is possible for man to create a text like the Quran?"
        },
        {
          "yes":5,
          "no":6,
          "content":"Do books, legends or documents exist other than the Judeo-Christian scriptures that came from Allah at the time of Jesus?"
        },
        {
          "no":6,
          "content":"Allah will say \"O Isa, son of Maryam, … [Allah] taught you the Book and the Wisdom, the Torah and  the Injil.\" (5:110). \"...if you are in doubt about what We have sent down to you, ask those who read the Book (revealed) before you\" (10:94).  Are you aware of any Surah that mentions books revealed by Allah other than the Tawrat, Injil or Zabur revealed to the people of the Book?"
        },
        {
          "yes":8,
          "no":7,
          "content":"So did portions of the Quran come from Arabic traditions that where not sent from Allah?"
        },
        {
          "yes":8,
          "no":8,
          "content":"Did a number of legends in the Qur'an come from existing Arabic folklore? Such as the she-camel prophet in Sura 7:73-77, 54:27-29, 91:13-14.  Such as the village turned to apes in Sura 2:65, 7:163-166.  Such as the legend of Moses and the 12 springs (2:60).  Such as the seven men and their animals that slept for 309 years in Surah 18:9-26."
        },
        {
          "yes":12,
          "no":9,
          "content":"Did the Quran copy many non-scriptural sources?"
        },
        {
          "yes":12,
          "no":10,
          "content":"Did portions of Sura Al-Imran come from a book that where not inspired by Allah, such as a counterfeit apocryphal history called the Protoevangelium of James the Lesser which contains the events of Sura 3:37, 3:40, 3:44 (which outlines supernatural provision of Mary, casting lots for Mary, Joseph being to old to concieve) 500 years before the Quran, but 100 years after Allah provide revelation to Isa (with physical evidence from 300 A.D.)?"
        },
        {
          "yes":12,
          "no":11,
          "content":"Did portions of Sura Al-A'raf, Qaf and Maryam come from a book that where not inspired by Allah, such as a counterfeit apocryphal history called the Testament of Abraham copying ideas of judgment being weighed, jinn recording good and bad records and that all will pass through fire 550 years before the Quran and 50 years after Allah provided revelation to Isa (with physical evidence from 500 A.D.)?"
        },
        {
          "yes":12,
          "no":12,
          "content":"Did portions of Sura Al-Ma'ida come from a book that where not inspired by Allah, such as a counterfeit apocryphal history called the Infancy Gospel of Thomas copying ideas of Isa made a bird of clay and brought it to life 450 years before the Quran and 150 years after Allah provided revelation to Isa (with physical evidence from 200 A.D.)?"
        },
        {
          "content":"Is the Quran incorrect when it says no one could create the Quran (10:37)?  Is the Qur'an incorrect when it states the Quran came directly from Allah (14:1)? Is the Qur'an incorrect when it says the only revelation that early believers need to stand on is the Tarwat, Zabur and Injil (5:110 , 10:94)? Is it possible that Muhammad copied non-scriptural texts available to him in the 7th century?"
        }
      ]
    },
    {
      "name":"Quran: How Many?",
      "slides":[

        {
          "yes":1,
          "no":1,
          "content":"The task of collecting the Quran did not begin until 632 AD during the Apostate Wars (when many people wanted to leave Islam).  Thousands of reciter's of the Quran were killed causing Caliph Umar to direct Zaid Ibn Thabit to gather up the recitations of the deceased Muhammad (written on stones, leaves, bones and from men's memories).   Zaid Ibn Thabit was not one of the authorised reciters of revelations.   Is it a problem that the man who compiled the Quran was not one officially chosen by Muhammad?"
        },
        {
          "yes":2,
          "no":2,
          "content":"13 years later, Zaid Ibn Thabit compiled <i>another</i> Quran under Caliph Uthman. Before this time at least 15 different versions of the Quran existed.  Uthman instructed Zaid to use verses from the Quraysh tribe when his two primary sources contradicted each other. We know that Zaid Ibn Thabit compiled at least two different Qurans, that his collected recitations contained contradictions and that at least 15 different Qurans existed before the completion of his work.  Are any of these other recitations the official revelation of Allah?"
        },
        {
          "yes":3,
          "no":3,
          "content":"Did you know that the Hadith recognize that entire verses were lost? Hadith no. 1944 in Sunan Ibn Majah indicates that verses were lost when eaten by a lamb.  These verses are referenced in Sahih Muslim 3597, 3598, 3600, 3605 but are absent from the Quran. Can verses from the Quran go missing?"
        },
        {
          "yes":4,
          "no":4,
          "content":"Once Zaid's \"<i>Uthmanic</i>\" compilation was complete, the caliph instructed all citizens – upon punishment of death – to destroy all variant Qurans.  Uthman was well aware that many versions of the recitations existed: Muhammad's chosen reciters had compilations very different than his.  Ubay bin Ka'b's quran had 116 sura. Ibn Mas'ud's 111-sura Quran had many major differences from Zaid's (according to Ibn Abu Dawud). If the authorized reciters' versions were destroyed in the creation of the Zaid's Quran, can his be official?"
        },
        {
          "yes":5,
          "no":5,
          "content":"After another 300 years of changes, Ibn Mujahid standardized the many versions that then existed. He took portions of the Uthmanic, the Warsh, Qulan, al-Bazzi, Qunbul, Hisham, Ibn Dakwan, al-Duri, al-Susi, Hafs, Abu Bakr, Khalaf, Khallad, Duri and Abul Harith. In the year 950 AD would it be fair to say there was only ever one Quran?"
        },
        {
          "yes":6,
          "no":6,
          "content":"The recitations of Muhammad refer to Judeo-Christian texts 105 times. The Quran states that the Judeo-Christian scriptures (Tawrat, Zabur, Injil) were correct at all times until the death of Muhammad (632 AD).  The references are utterly incorrect.  Either the Quran is highly incorrect about what it says about these texts or these texts are incorrect.  Approximately 400 years after the Uthmanic text, Ibn Hazm created the doctrine of Tahrif (distortion) which declared the Judeo-Christian scriptures corrupt.  Are earlier 'divine revelations' distorted?"
        },
        {
          "yes":7,
          "no":7,
          "content":"Today, two major versions of the Qur'an are the Hafs and the Warsh (which is used in North-West Africa and Yemen). There are currently 26 different recognized Arabic versions of the Qur'an. Do you use any of these version?"
        },
        {
          "yes":8,
          "no":8,
          "content":"Major differences exist between the two primary texts (Hafs, Warsh): the audience changes, the author of events changes, Muhammad's words are assigned to different people, Allah does entirely different actions and more. Were you aware the Muslim faith included these differences?"
        },
        {
          "content":"The Quran has many <i>different</i> versions, missing texts, additions (diacritic marks), unauthorized editors and was continually revised.  It is factually incorrect or forces other divine texts to be incorrect.  If any of these assertions are correct the Quran violates its own text: \"<i>And none can alter the words of Allah</i>\" (Surah 6:34), \"<i>Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.</i>\" (Surah 15:9). Is Allah protecting those words or not?"
        }
      ]
    },
    {
      "name":"After the Quran: Hadith",
      "slides":[
        {
          "yes":2,
          "no":1,
          "content":"Should you be able to understand the Quran and Hadith?"
        },
        {
          "no":2,
          "content":"Surah 19:97 \"<i>So We have made this (the Quran) easy in your own tongue</i>\" and Surah 54:17 \"<i>And We have indeed made the Quran easy to understand and remember</i>\". Are you still sure?"
        },
        {
          "yes":4,
          "no":3,
          "content":"Do the Quran and Hadith need to be consistent (<i>without error</i>)?"
        },
        {
          "no":4,
          "content":"Surah 4:82 \"<i>If it had been from [any] other than Allah, they would have found within it much contradiction</i>\". Are you still sure?"
        },
        {
          "yes":5,
          "no":6,
          "content":"Is there a need for further text other than the Quran?"
        },
        {
          "no":6,
          "content":"Surah 16:89 \"<i>We reveal the Scripture unto thee as an exposition of all things</i>\", Also, supposedly the last verse 'revealed' to Mohammed is Surah 5:3 containing \"<i>today I have perfected your religion and completed my favor on you</i>\". Are you still sure?"
        },
        {
          "no":7,
          "content":"Can you remember anything about the behavior of Maharaja Ranjit Singh (<i>Founder of Sikh, 1780</i>), Shaka Zulu (<i>Zulu Emperor, 1787</i>), Charles Babbage (<i>father of computing, 1791</i>), John Wesley (<i>English cleric with over 400 published works</i>), William Pitt (<i>Youngest English prime minister, 1759</i>) Mayer Amschel Rothschild (<i>business man, 1744</i>), Mahumad II (<i>Sultan of Ottoman Empire, 1785</i>), Napoleon (<i>French Emperor, 1769</i>), Ludwig Beethoven (<i>Composer, 1770</i>), King George III (<i>British Monarch, 1738</i>)?"
        },
        {
          "yes":8,
          "no":8,
          "content":"The Hadith were not completed until three centuries after the death of Mohammad.  Is it possible the records of a man's life from oral history almost 300 years after his death are incorrect?"
        },
        {
          "yes":9,
          "no":10,
          "content":"Was the Hadith written by those closest to Mohammed?"
        },
        {
          "yes":10,
          "no":10,
          "content":"Abu Hurayrah a late convert to Islam created 7 hadith per day. Abdullah ibn Umar, in his early to mid-teens, recorded 2600 hadith. Anas bin Malik was given by his mother as a servant at the age of twelve and recorded 2500 in the next ten years. Abdullah bin Abbas was 12 years old when Mohammed died but still managed to write 1660 hadith! Jabir bin Abdullah made a living sharing his 1540 hadith. Abu Said al Khudri was initially too young to fight with Mohammed near the end of his life but was able to produce 1170 hadith. Including Aisha, recorder of 2200 hadith, these nearly inconsequential companions (<i>six of some 124,000 at the time of Mohammed's death</i>) recorded over half the primary hadith. Is their contribution important?"
        },
        {
          "yes":11,
          "no":11,
          "content":"The vast majority of Sharia comes not from the Quran, but the Hadith. It is argued theology is understood and argued through the Hadith.  6 minor acquaintances of Mohammed and his youngest teenage wife have essentially written muslim law and theology, is this acceptable? "
        },
        {
          "yes":12,
          "no":13,
          "content":"Did those closest to Mohammed believe hadith were necessary?"
        },
        {
          "yes":13,
          "no":13,
          "content":"Like all close followers, less than 0.5% of Kutub al-Sittah are attributed to Abu Bakr who supposedly burnt his hadith. Caliph Omar absolutely forbid the recitation of hadith.  Caliph Uthman forbid the speaking of most hadith. The majority of hadith were written by very minor companions and Aisha, Mohammed's last wife. Do you still believe it was close companions who wrote and supported the hadith? "
        },
        {
          "yes":14,
          "no":14,
          "content":"Jim said all horses in the 15th century were blue, Jim told John (<i>a very honest guy</i>) who wrote it down for me. There are many false statements about horses in the 15th century.  Do these facts make all horses in the 15th century blue?"
        },
        {
          "no":15,
          "content":"Abu Hanifa invented hadith criticism (<i>150 AH</i>) solely because there were far too many fake hadith.  The 'science' that hadith needed to be internally confirmed (<i>mutawatir, about 0.1% of hadith</i>), proceed from a reputable author and be accompanied with a chain of transmission arose because of the vast amount of fake hadith.  After Islamic civil wars, both factions created vast libraries of hadith.  Each year more and more hadith emerged that met the arbitrary rules of hadith criticism.  Hadith were never criticized upon their content, but only their chain of transmission and supposed authorship.  This meant that, primarily, most hadith never met the criteria of being internally verified (<i>99.9% of hadith are not mutawatir</i>), these hadith were written by minor companions of Mohammed and it appears more forged hadith began to appear every year for generations.  If I add a list of people who heard the fact to a fact, does it make it more correct hundreds of years after the fact?"
        },
        {
          "yes":16,
          "no":16,
          "content":"The Quran should not have any errors (Surah 4:82).  If the Hadith are full of errors does that indicate they are not from Allah?"
        },
        {
          "yes":18,
          "no":17,
          "content":"Is the hadith full of contradictions and/or error?"
        },
        {
          "yes":18,
          "no":18,
          "content":"Aisha said that any who say Mohammed has seen Allah is a liar (<i>Sahih Bukhari 1:4:159</i>), Ibn 'Abbas said Mohammed saw Allah (<i>Sahih Muslim 1:334</i>).  Ibn 'Abbas said Mohammad ritually cleansed himself once, 'Abdullah bin Zaid says twice, Humran says three times (<i>Sahih Bukhari 1:4:159-161</i>). Mohammed said evil omens do not exist (<i>Sahih Muslim 26:5508</i>), then says at least three evil omens exist (<i>Sahih Bukhari 7:71:666</i>). Sahih Muslim 4:1766-7 says that verses at the beginning of Surah 18 or possibly the end of Surah 18 (<i>it is not known as the narrators contradict each other</i>) are used to ward off evil. Ibn Umar says Dajjil is blind in one eye: the right (<i>Sahih Muslim 41:7005</i>).  Hudhalfa says Mohammed said it was the left (<i>Sahih Muslim 41:7010</i>). Sahih Muslim states Mohammed disapproved of drinking while standing, but did so.  Sahih Bukhari and Sahih Muslim  do not agree on the number of years Mohammed was in Mecca (<i>10,13,15</i>). Rules regarding the trade of precious metals contradict each other.  The recorders of the Quran differs by narrator and neither match historical records and the Uthmanic revision.  And the value of congregational prayer is valued differently by different authors. These just represent errors within Sahih Bukhari and Sahih Muslim and not the Hadith and Quran.  Is this enough errors to consider the hadith not from God?"
        },
        {
          "yes":19,
          "no":19,
          "content":"OK, ignoring errors in the hadith, the fact that the Quran should be complete alone (<i>Surah 5:3, 16:89</i>), their constant forgery, unfavorable authorship and the fact they were not allowed by close companions of the author of the Quran, should hadith make up most of Sharia law?"
        },
        {
          "yes":21,
          "no":20,
          "content":"We understand that the Quran was made easy to understand (<i>Surah 19:97, 54:17</i>) is complete (<i>Surah 5:3, 16:89</i>) and without error (<i>Surah 4:82</i>). Has the hadith and future theology made additions to the Quran and it's philosophy?"
        },
        {
          "yes":21,
          "no":21,
          "content":"The Quran was compiled by those not chosen by the author, 15 different contradicting versions existed at the compilation of the Uthmanic revision, authorized copies of surah were destroyed, surah were lost (<i>a violation of Surah 15:9, 41:42</i>), 300 years after consolidation a new Quran was compiled from at least 15 derivative version, diacritic marks where added for 300 years, until today where there are 26 different Arabic Qurans including two major variant texts (<i>the Hafs and the Warsh</i>). Is there only one Quran and is it free from changes, differences and unauthorized corrections?"
        },
        {
          "yes":22,
          "no":23,
          "content":"Doctrines have continually been added to Islam to supplement the already 'complete' theology.  Because the 105 references the Quran makes to prior scripture (Tawrat, Zabur, Injil) are completely incorrect, the doctrine of Tahrif (<i>distortion</i>) was added 400 years after the Quran. Because contradictions occurred in the Quran itself (<i>and between Quran and Hadith</i>) the doctrine of Naskh (<i>abrogation</i>) was included 300 years after the Quran.  To this day there is no consensus regarding which verses are mansukh (<i>ranging from 10 to 500 verses</i>). The Quran includes numerous prior human sources despite stating that only Allah could produce the Quran (<i>Surah 10:37</i>). Can a book with so many updates be considered complete?"
        },
        {
          "no":23,
          "content":"George Lucas complete Star Wars the motion picture in 1977.  In 1997 Lucas released the 'Special Edition'.  In 2004 the DVD release contained added and upgraded scenes. More changes where made in 2011 and 2019 for the Blu-ray and 4K editions. Characters were changed, new scenes were introduced, new dialogue, the size of the antagonists increased and the title of the film was changed to allow for many more movie additions. Is the 2019 release of Star Wars the same as the movie seen in theaters in 1977?"
        },
        {
          "content":"Finally, <i>Noiseless sound, wise fool, married bachelor, miniature giant, proud humility</i> and <i>hateful good</i> are all contradictions in terms.  Contradictions in terms can not exist. I can not say I am a truthful liar. The law of non-contradiction negates the value of that statement.  Something can not be all true and all false. However, Allah states that \"<i>if We willed We could withdraw that which We have revealed unto thee</i>\" (<i>Surah 17:86</i>).  Withdrawal in this text is the word Naskh or abrogation, not hiding or obscuring. This means that Allah could contradict every statement made in the Quran.  As a result, even if the Quran were without addition, correction or change as claimed, it can not reveal anything of meaning about Allah as it can be erased without consequence to Allah.  If this is true, can you please name one thing in the Quran or Hadith you know is absolutely true."
        }
      ]
    },
    {
      "name":"External: Leadership",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content":"In Southeast Asia <i>Hinduism</i> spread from India eastward.  Religion was used to tie workers to the land through their worship of the <i>devarajas</i> (god-kings).  After the decline of the Khmer Empire in the 14th century, Southeast Asia saw the predominace of <i>Buddhism</i> first through the kings and then the population.  The kingdom at Malacca likewise accepted <i>Islam</i> as a religion to rule its people.  The king of Malacca (Parameswara) declared Islam the religion of his people but the ruling monarch (Muhammad Shah) only personally accepted Islam three generations later. Earlier monuments to Islam (ex. <i>Terrenganu Inscription Stone</i>) exist primarily to delinate vassal responsibilities.  <i>Is it ok for kings to decide what someone believes</i>?"
        },
        {
          "yes":2,
          "no":2,
          "content":"Two women from Iran, while inprisoned at Evin Prison in Tehran stated to their captor \"<i>This regime tells its people that the regime knows best and that we should all do as we're told.  It's message is, 'Shut up, say nothing in protest, do what we say'<i>\" Is there any time that you have felt unable to do what is right because of instructions from leaders? "
        },
        {
          "yes":3,
          "no":4,
          "content":"If you saw a man drowning, who had only a few minutes to live, would you help him?"
        },
        {
          "yes":4,
          "no":4,
          "content":"What if your imam, boss, leader told you that they did not like that man or did not want you to save them, would you still help the man?"
        },
        {
          "yes":6,
          "no":5,
          "content":"Knowing that you have all the power to resuce that man, will Allah judge you for letting the man drown?"
        },
        {
          "yes":7,
          "no":6,
          "content":"Do you have any responsibility to do right if you are told do wrong?"
        },
        {
          "content":"Give an example of a situation when it is right to murder, rape or steal (<i>or any other wrong</i>) if commanded by an imam, leader, boss?"
        },
        {
          "content":"Who will Allah hold accountable, you who was given the power to make your own decisions, or leaders who you decided to make decisions for you?"
        }
      ]
    },
    {
      "name":"External: Morality",
      "slides":[
        {
          "yes":2,
          "no":1,
          "content": "Is it ok for a man to wear woman's clothing?"
        },
        {
          "no":2,
          "content": "<b>Are you sure?</b> prophet wears Aisha's garment (<em>Sahih Bukhari 2393, 2442, 3941</em>), Aisha states Muhammad is wearing her clothes (<em>Sahih Muslim 31:5984</em>),  Fatima attempts to see the prophet while he is wearing Aisha's robe (<em>Sahih Muslim 4472</em>)"
        },
        {
          "yes":4,
          "no":3,
          "content": "Is it ok to someone to pay another person to convert their religion (a bribe)?"
        },
        {
          "no":4,
          "content": "<b>Are you sure?</b> \"He ( the Prophet, ) gives the chief of Najd and does not give us.\" The Prophet said, \"I give them so as to attract their hearts (to Islam).\" (<em>Sahih Bukhari 4:55:558</em>)"
        },
        {
          "yes":6,
          "no":5,
          "content": "Is it ok to lie?"
        },
        {
          "no":6,
          "content": "<b>Are you sure?</b> like unbelievers, Allah also plots / lies and is the best liar / plotter (<em>Surah 8:30</em>), states Allah decieves people toward a path of misery (<em>Surah 92:10</em>), By Allah ... if I take an oath and later find something else better than that. then I do what is better and expiate my oath. (<em>Sahih Bukhari 7:67:427</em>)"
        },
        {
          "yes":8,
          "no":7,
          "content": "Is it ok to hate other people?"
        },
        {
          "no":8,
          "content": "<b>Are you sure?</b>  Ibrahim is raised as an example whereby individuals should hate unbelievers (<em>Quran 60:4</em>)"
        },
        {
          "yes":10,
          "no":9,
          "content": "Could the god of Islam actually currently be tricking a faithful muslim, so that he thinks he is doing well, but actually god has tricked him and is sending him to hell?"
        },
        {
          "no":10,
          "content": "<b>Are you sure?</b> Then would they offer submission (with the pretence), \"We did no evil (knowingly).\" (The angels will reply), \"Nay, but verily Allah knows all that ye did; \"So enter the gates of Hell, to dwell therein. (<em>16:28-29</em>)"
        },
        {
          "yes":12,
          "no":11,
          "content": "Have you made any mistakes? Is it possible that Allah is not guiding you at all?"
        },
        {
          "content": "<b>Are you sure?</b> And Allah guideth not the evil-living folk. (<em>Surah 61:5</em>)"
        }
      ]
    },
    {
      "name":"External: Equality & Jannah",
      "slides":[
        {
          "yes":1,
          "no":1,
          "content": "Is it true that Disbelievers go to hell, disbelievers are not a harm to Allah, they are blinded (made to ignore god) by Allah and they should not be warned (<em>Surah 2 & 3</em>)?"
        },
        {
          "yes":2,
          "no":3,
          "content": "Is it the unbelivers choice to unbelieve?"
        },
        {
          "no":3,
          "content": "<b>Are you sure?</b> No soul can believe, except by the will of Allah, and He will place doubt (or obscurity) on those who will not understand (<em>10:100</em>)"
        },
        {
          "yes":5,
          "no":4,
          "content": "Does Allah directly create the evil act of the unbeliever?"
        },
        {
          "no":5,
          "content": "<b>Are you sure?</b> but He causes to err whom He pleases...(<em>16:93</em>), ...and whomsoever Allah causes to err, you shall not find a way for him. (<em>4:143</em>, see also <em>4:88</em> and <em>74:31</em>)"
        },
        {
          "yes":6,
          "no":6,
          "content": "Can you be guilty of doing something in a court of law, if you were not in control of your actions, thought or body (ie. is a puppet guilty)?"
        },
        {
          "yes":8,
          "no":7,
          "content": "Could God rescue these unbeleivers? "
        },
        {
          "no":8,
          "content": "<b>Are you sure?</b> If We had so willed, We could certainly have brought every soul its true guidance (<em>32:13</em>). And Allah's is the direction of the way, and some (roads) go not straight. And had He willed He would have led you all aright. (<em>16:9</em>)"
        },
        {
          "content": "The Quran also states that <i>We created you from a single (pair) of a male and a female and made you into nations and tribes that ye may know each other (not that ye may despise each other).</i> <em>Surah 49:13</em>  - If all men are equal why does the Quran / Allah / Muhammad repeatedly call the believers to murder, disposses, torture, wage war against, rape, dehumanzie (<em>Sahih Bukhari 4:52:256</em>), enslave and hate their brothers who are doomed, with no hope reprieve to eternal torment?"

        }
      ]
    }
  ],
  "problem": "<b>Non-muslims</b>",
  "law":"Islam reserves two modes of judgment: <b>consequences during your life and eternal judgment</b>.  In life each crime is judged; in paradise crimes are ignored given enough 'good' works. <b>the largest penalty is reserved for non-muslims and apostates.</b><br><br>Individual acts can merit punishment ranging from minor (<em>forgiveness for murder</em>) to major (<em>death for apostasy, amputation for theft</em>). Surah 7:6-9 makes it clear that individuals that do not have more good deeds than bad, will suffer punishment. Surah 21:47 makes it clear that no deed will escape the scale for weighing on the day of final justice. Justice during this life is accomplished by adhering to prescriptions found in the Hadith.",
  "punishment":"<b>Murders, rapists, thieves and any other type of crime (excluding blasphemy - Surah 5:33) will be overlooked by God</b>.  The creator of the universe allows violations of any moral principle when weighed against works. In a person's life they may be killed, amputated, beaten or tortured for violating a moral principle that will be ignored later.  <b>Moral code and its punishments can be abrogated or differ in eternity (from creation), making any understanding of the creator's moral character impossible, if it exists</b>.",
  "hope":"Allah remains silent.  <b>Tahwid means that god is so different from that which he created (<em>man</em>) that not only can we not understand Allah</b>, there is little hope of any meaningful interchange occuring between Allah and man.  Allah is to be feared and respected, but not known.<br><br><b>A man who has raped or murdered can stand next to Allah in paradise</b> as long as he has provided alms or fought in just war (<em>Surah 21:47</em>). If evil men, guilty of any crime can stand in friendship with Allah, why should we assume Allah is good?"
}